[
    {
      "fdnm": "Ayam Betutu",
      "imgurl": "https://user-images.githubusercontent.com/106671990/208844251-d8ae7667-8f6d-4fdc-a382-0ea72602dacb.png",
      "imgurl2":"https://user-images.githubusercontent.com/106671990/208839708-ad4fc686-0b40-467f-8852-bc29f04a23aa.png",
      "desc":"Ayam betutu merupakan jenis lauk pauk yang dibuat dari daging ayam yang telah dibersihkan kemudian dibalurkan bumbu khas Bali yang dikenal dengan base genep di seluruh permukaan tubuh daging ayam dan sebagian lagi dimasukkan ke dalam rongga abdomennya.",
      "type":"berkuah",
      "Kalori":"425",
      "Protein":"22.2",
      "Lemak":"35.7",
      "Karbohidrat":"5.8",
      "langkah1":"Lumuri rata ayam dengan bumbu dasar B, biarkan semalam.",
      "langkah2":"Tambahkan serai dan daun salam, lalu bungkus ayam dengan daun pisang, bungkus lagi dengan aluminium foil.",
      "langkah3":"Kukus dalam dandang panas selama 4  jam. Angkat.",
      "langkah4":"Panggang dalam oven panas bersuhu 100ºC selama 1 jam hingga matang",
      "bahan1":"1 Ekor Ayam Kampung",
      "bahan2":"2 Batang Serai",
      "bahan3":"2 Lembar daun salam",
      "bahan4":"4 Daun Jeruk",
      "bahan5":"Minyak Goreng Secukupnya",
      "bahan6":"Bumbu Halus"
    },
    {
      "fdnm": "Sate Lilit",
      "imgurl": "https://user-images.githubusercontent.com/106671990/208844371-da04e021-5240-4f40-b052-37ef332ac778.png",
      "imgurl2":"https://user-images.githubusercontent.com/106671990/208839863-7d187c31-ab4c-4cdb-942e-b1f94e1907d7.png",
      "desc":"Sate Lilit adalah sebuah varian sate asal Bali. Sate ini terbuat dari daging babi, ikan, ayam, daging sapi, atau bahkan kura-kura yang dicincang, kemudian dicampur dengan parutan kelapa, santan, jeruk nipis, bawang merah, dan merica.",
      "type":"berkuah",
      "Kalori":"250",
      "Protein":"19",
      "Lemak":"18",
      "Karbohidrat":"3",
      "langkah1":"Haluskan ayam. Sisihkan.",
      "langkah2":"Iris semua bumbu halus. Tumis dan tambahkan daun jeruk.",
      "langkah3":"Buang daun jeruk, kemudian haluskan bumbu, beri gula merah.",
      "langkah4":"Campurkan ayam, kelapa parut dan bumbu halus. Tambahkan santan. lilitkan lalu bakar.",
      "bahan1":"500 g daging ayam cincang",
      "bahan2":"2 sdm minyak sayur",
      "bahan3":"50 g bawang merah",
      "bahan4":"20 g bawang putih",
      "bahan5":"2 cabai merah",
      "bahan6":"Bumbu Halus"
    },
    {
      "fdnm": "Nasi Jinggo",
      "imgurl": "https://user-images.githubusercontent.com/106671990/208844565-bb3134ff-04d9-47f7-b907-53548aa94f7e.png",
      "imgurl2":"https://user-images.githubusercontent.com/106671990/208840017-08e4c169-8c5c-4d21-909e-f1f0b80cb40e.png",
      "desc":"Nasi jenggo (atau nasi jinggo) adalah makanan siap saji khas Bali yang dikemasan daun pisang dengan porsi kecil. Dalam bahasa Hokkien, jeng go memiliki arti seribu lima ratus. Kini, harga satu porsi nasi jenggo adalah sekitar Rp 5.000.",
      "type":"berkuah",
      "Kalori":"590",
      "Protein":"26.94",
      "Lemak":"21.41",
      "Karbohidrat":"70.19",
      "langkah1":"Rebus masing-masing sayuran di dalam 1.000 ml air dan 1 sendok teh garam. Angkat. Tiriskan",
      "langkah2":"Panaskan minyak goreng dalam wajan, masukkan bumbu halus, salam, serai, dan lengkuas. Bubuhkan garam dan gula, aduk hingga berbau harum. Masukkan ayam suwir, aduk rata, masak hingga seluruhnya matang dan cairan mengering, tambahkan kemangi, aduk rata",
      "langkah3":"Aduk rata tumisan bumbu, tempe, kelapa parut, dan telur. Bagi menjadi 12 bagian.",
      "langkah4":"Siapkan sepiring nasi putih hangat, tambahkan sate lilit tempe, ikan pelalah, urap, dan telur rebus. Tambahkan sambal matah,segera sajikan.",
      "bahan1":"Sate Lilit tempe",
      "bahan2":"Urap",
      "bahan3":"Ikan Pelalah",
      "bahan4":"Telur",
      "bahan5":"Minyak Goreng",
      "bahan6":"Bumbu Halus"
    },
    {
      "fdnm": "Nasi Tepeng",
      "imgurl": "https://user-images.githubusercontent.com/106671990/208844719-64ead909-389d-4480-a28b-daa00b4ee2b4.png",
      "imgurl2":"https://user-images.githubusercontent.com/106671990/208840221-7716fcd7-c174-4fda-81fa-6ac87f3f1882.png",
      "desc":"Nasi Tepeng adalah hidangan sarapan khas daerah Gianyar Bali yang terbuat dari campuran nasi dan rempah-rempah. Teksturnya memang agak lembek, namun mempunyai cita rasa yang berbeda. Untuk membuatnya, Bunda dapat mencampurkan beras dengan Kobe Bumbu Nasi Goreng Poll Ayaaam dan rempah-rempah.",
      "type":"berkuah",
      "Kalori":"104",
      "Protein":"1.90",
      "Lemak":"4.10",
      "Karbohidrat":"15.10",
      "langkah1":"Pertama, campurkan beras, air, dan santan Kemudian, masukkan juga daun salam, serai, dan kunyit.",
      "langkah2":"Selanjutnya, tambahkan garam dan bahan-bahan bumbu halus",
      "langkah3":"Terakhir, tambahkan nangka dan terong, lalu aduk dan masak dalam penanak nasi hingga matang",
      "langkah4":"Setelah matang, sajikan nasi tepeng selagi hangat.",
      "bahan1":"350 gram beras (cuci bersih)",
      "bahan2":"400 ml air",
      "bahan3":"200 ml santan",
      "bahan4":"4 lembar daun salam",
      "bahan5":"2 batang serai",
      "bahan6":"Bumbu Halus"
    },
    {
      "fdnm": "Pie Susu",
      "imgurl": "https://user-images.githubusercontent.com/106671990/208844863-673bff83-a178-4b7d-9a58-fa3ba80b9fb1.png",
      "imgurl2":"https://user-images.githubusercontent.com/106671990/208840349-4fdf45b8-0509-48df-b10e-06e41c6c1cdb.png",
      "desc":"Pai susu adalah sebuah pastri hidangan penutup tradisional Indonesia yang terbuat dari kue pastri yang diisi dengan kustar telur serta susu kental manis. Pastri tersebut sangat datar dengan isian hanya terdiri dari satu lapisan kustar yang sangat tipis. Asal pastri tersebut berasal dari Bali.",
      "type":"berkuah",
      "Kalori":"130",
      "Protein":"1.9",
      "Lemak":"10",
      "Karbohidrat":"32",
      "langkah1":"Untuk membuat kulit pie, masukkan tepung terigu dan gula halus dalam satu wadah. Aduk hingga rata. Kemudian masukkan margarin lalu aduk hingga seperti butiran pasir. Lalu masukkan kuning telur aduk dan uleni sampai kalis.",
      "langkah2":"Untuk membuat fla, masukkan telur kedalam wadah lalu kocok (saya menggunakan mixer) hingga tercampur. Kemudian masukkan susu cair, kkm dan tepung maizena dan aduk lagi hingga rata. Setelahnya saring agar hasilnya akan menjadi lembut",
      "langkah3":"Setelah ukuran sesuai, masukkan kedalam cup, pipihkan sesuai dengan bentuk cup lalu tusuk bagian tengah adonan dengan garpu agar saat dipanggang tidak mengembang",
      "langkah4":"Apabila circle pada adonan sudah terbentuk maka sudah siap diangkat. Angkat dan diamkan selama 10 menit. Lalu keluarkan adonan dari dalam cup dan sajikan selagi hangat.",
      "bahan1":"250 gr tepung terigu.",
      "bahan2":"125 gr margarin.",
      "bahan3":"1 sdm gula halus ",
      "bahan4":"1 btr kuning telur ",
      "bahan5":"300 gr susu UHT.",
      "bahan6":"200 gr krimer kental manis."
    }
]