[
    {
      "fdnm": "Soto Kudus",
      "imgurl": "https://user-images.githubusercontent.com/106671990/205538902-9329f142-424a-4b5a-851c-bc40352e4c38.jpg",
      "imgurl2":"https://user-images.githubusercontent.com/106671990/208897148-a20db9b1-b4da-43c9-9495-bd05e8d7024b.png",
      "desc":"Soto Kudus adalah soto yang berasal dari Kudus, Jawa Tengah. Soto kudus, hampir mirip dengan soto Lamongan, soto kudus berisi suwiran ayam dan taoge. Terkadang soto kudus juga menggunakan daging kerbau.",
      "type":"berkuah",
      "Kalori": "425",
      "Protein": "22",
      "Lemak": "35",
      "Karbohidrat": "58",
      "langkah1":"Panaskan minyak, tumis bumbu halus hingga harum dan matang. Angkat dan sisihkan.",
      "langkah2":"Rebus dada ayam, lengkuas, serai, dan daun salam. Tambahkan gula dan garam. Masak hingga dada ayam matang. Keluarkan daging ayam, suwir-suwir, dan sisihkan.",
      "langkah3":"Panaskan kembali kaldu bersama bumbu tumis, Royco Kaldu Ayam, air jeruk nipis, dan Bango Kecap Manis. Aduk rata.",
      "langkah4":"Dalam mangkuk saji, tata dada ayam, taoge, telur ayam rebus. Tuang kuah soto, taburi irisan daun seledri, daun bawang, dan bawang merah goreng.",
      "bahan1":"300 g fillet daging ayam",
      "bahan2":"1 batang serai, memarkan",
      "bahan3":"3 sdm air jeruk nipis",
      "bahan4":"3 sdm minyak, untuk menumis",
      "bahan5":"1 sdt gula pasir",
      "bahan6":"Bumbu Halus"
    },
    {
      "fdnm": "Kupat Tahu Solo",
      "imgurl": "https://user-images.githubusercontent.com/106671990/205539281-8831f2a9-c507-4615-9ab8-ce1db82b3151.jpg",
      "imgurl2":"https://user-images.githubusercontent.com/106671990/208897391-c3798cfb-0e26-4004-b00f-840968b87b4a.png",
      "desc":"Kupat tahu adalah makanan tradisional Indonesia yang berbahan dasar ketupat, tahu, kol, dan tauge yang telah digoreng, dicampur dengan bumbu kacang dan kecap. Sebagai alternatif, lontong dapat juga digunakan sebagai pengganti ketupat.",
      "type":"nonkuah",
      "Kalori": "425",
      "Protein": "22",
      "Lemak": "35",
      "Karbohidrat": "58",
      "langkah1":"Pertama, buat bakwannya dahulu. Iris tipis sayuran, ulek halus bawang putih dan sedikit garam.",
      "langkah2":"Campurkan semua bahan dengan tepung terigu. Tuang air secukupnya seperti membuat adonan bakwan pada umumnya.",
      "langkah3":"Rebus air untuk kuah, masukkan semua bahan. Tes rasa jika sudah mendidih, rasanya cenderung manis tapi ada rasa gurihnya",
      "langkah4":"Goreng tahu yang sudah dipotong dadu hingga matang, angkat. Rebus mie telur, tiriskan. Potong ketupat dan bakwan. Siram kubis dengan air mendidih.",
      "bahan1":"2 buah ketupat",
      "bahan2":"100 g mie telur",
      "bahan3":"50 g tahu putih",
      "bahan4":"5 lembar kubis",
      "bahan5":"3 lembar daun jeruk",
      "bahan6":"cabai rawit secukupnya"
    },
    {
      "fdnm": "Mie Ongklok Wonosobo",
      "imgurl": "https://user-images.githubusercontent.com/106671990/205539206-375f5a7a-aa8f-4cb1-a019-3af0e56102bf.jpg",
      "imgurl2":"https://user-images.githubusercontent.com/106671990/208897509-bb659639-68a2-4643-a857-d5643acb7844.png",
      "desc":"Mi ongklok adalah mi rebus khas kota Wonosobo dan sekitarnya. Mi rebus ini dibuat dengan menggunakan kol, potongan daun kucai, dan kuah kental berkanji yang disebut loh. Mi ini banyak dijajakan di berbagai warung, rumah makan, maupun dijajakan keliling memakai gerobak di kota tersebut.",
      "type":"berkuah",
      "Kalori": "425",
      "Protein": "22",
      "Lemak": "35",
      "Karbohidrat": "58",
      "langkah1":"Rebus mie, kubis dan tauge sampai empuk, tiriskan, tata di atas mangkok.",
      "langkah2":"Tumis bawang putih sampai harum, masukkan ayam dan bakso, tambahkan Bango Kecap Manis, saos tiram, garam dan lada putih bubuk. Masukkan sedikit air. Masak sampai ayam empuk, kentalkan dengan tepung maizena.",
      "langkah3":"Siram kuah kental diatas mie.",
      "langkah4":"Sajikan hangat.",
      "bahan1":"150 g mi kuning, seduh air panas, tiriskan ",
      "bahan2":" 50 g taoge",
      "bahan3":" 2 lembar kol, iris",
      "bahan4":"100 g fillet ayam, iris tipis",
      "bahan5":" 1/2 sdt Royco Kaldu Ayam",
      "bahan6":" 2 sdm Bango Kecap Manis"
    },
    {
      "fdnm": "Lumpia Semarang",
      "imgurl": "https://user-images.githubusercontent.com/106671990/205539073-4366f1a2-3f4e-4fe6-b747-0a4ecde47549.jpg",
      "imgurl2":"https://user-images.githubusercontent.com/106671990/208898012-37bfd55f-65a1-4041-b869-9bd94ac9d71e.png",
      "desc":"Lumpia semarang adalah makanan semacam rollade yang berisi rebung, telur, dan daging ayam atau udang. Cita rasa lumpia semarang adalah perpaduan rasa antara Tionghoa dan Indonesia karena pertama kali dibuat oleh seorang keturunan Tionghoa yang menikah dengan orang Indonesia dan menetap di Semarang, Jawa Tengah",
      "type":"goreng",
      "Kalori": "425",
      "Protein": "22",
      "Lemak": "35",
      "Karbohidrat": "58",
      "langkah1":"Tumis bumbu halus hingga harum. Tambahkan daging ayam, rebung, telur ayam, Royco Kaldu Ayam, garam, gula, dan Bango Kecap Manis. Aduk hingga tercampur rata, lalu tuangkan air. Masak kembali hingga matang dan air meresap.",
      "langkah2":"Ambil satu lembar kulit lumpia, beri isian, dan lumuri sedikit putih telur di sekeliling batas kulit lumpia. Kemudian lipat, gulung, dan rekatkan.",
      "langkah3":"Goreng lumpia hingga matang dan berwarna kecokelatan. Tiriskan.",
      "langkah4":"Sajikan hangat bersama pelengkap kesukaan.",
      "bahan1":"200 g rebung, rebus dan potong korek",
      "bahan2":"2 butir telur ayam",
      "bahan3":"200 g daging ayam giling",
      "bahan4":"10 lembar kulit lumpia",
      "bahan5":" 1 sdt gula pasir",
      "bahan6":" 1/2 sdt garam"
    },
    {
      "fdnm": "Mendoan Banyumas",
      "imgurl": "https://user-images.githubusercontent.com/106671990/205538970-e5f9d9ed-65e3-4759-a082-b8da32284f90.jpg",
      "imgurl2":"https://user-images.githubusercontent.com/106671990/208898235-6b2a73df-050b-4886-a62a-791938b172fb.png",
      "desc":"Mendoan adalah makanan sejenis gorengan yang berasal dari Eks Keresidenan Banyumas, Jawa Tengah. Kata Mendoan sendiri berasal dari bahasa Banyumasan, yaitu mendo yang berarti setengah matang atau lembek.",
      "type":"goreng",
      "Kalori": "425",
      "Protein": "22",
      "Lemak": "35",
      "Karbohidrat": "58",
      "langkah1":"Lumuri potongan tempe dengan bahan marinasi tempe yang telah dihaluskan dan biarkan meresap selama 10-15 menit.",
      "langkah2":"Campur tepung terigu, tepung tapioka, daun bawang dengan air hingga rata.",
      "langkah3":"Lapisi potongan tempe dengan adonan, masak di dalam wajan berminyak panas hingga setengah matang.",
      "langkah4":"Hidangkan dengan sambal",
      "bahan1":"400 g tempe, iris agak tipis dan beri keratan",
      "bahan2":" 250 g tepung terigu",
      "bahan3":" 2 batang daun bawang, iris tipis",
      "bahan4":" 1 sdm tepung tapioka",
      "bahan5":"400 ml air ",
      "bahan6":"Bumbu Halus"
    }
]