[
  {
    "regname":"jatim",
    "fdnm": "Bebek Madura",
    "imgurl": "https://user-images.githubusercontent.com/106671990/208849889-3dfba9c3-dd10-450c-9820-4db43e6900a9.png",
    "imgurl2":"https://user-images.githubusercontent.com/106671990/208838989-6ba40deb-d8d6-45c4-a60d-215c691e79df.png",
    "desc":"Soto Lamongan adalah sajian makanan soto ayam yang khas dari daerah Lamongan, Jawa Timur. Salah satu ciri khas dari Soto Lamongan ini terletak pada serbuk krupuk udangnya yang sering disebut koya atau poya.",
    "type":"berkuah",
    "Kalori":"312",
    "Protein":"24.01",
    "Lemak":"14.92",
    "Karbohidrat":"19.55",
    "langkah1":"Lumuri bebek dengan perasan air jeruk nipis. Diamkan selama 30 menit di lemari es.",
    "langkah2":"Rebus bebek bersama air, air asam, dan garam. Buang air rebusan dan cuci bersih bebek. Sisihkan.",
    "langkah3":"Dalam wajan besar, panaskan minyak lalu tumis bumbu halus hingga harum.",
    "langkah4":"Tambahkan sedikit air panas bila bebek sudah mulai tidak terendam minyak. Biarkan masak hingga daging bebek empuk dan warnanya menghitam. Angkat dan tiriskan.",
    "bahan1":"Bebek, belah 4 bagian  1 ekor",
    "bahan2":"Lengkuas, memarkan - 3 cm",
    "bahan3":"Serai, memarkan - 3 batang",
    "bahan4":"Air asam - 4 sdmGaram - 1 sdm",
    "bahan5":"Jeruk nipis, ambil air persannya - 1 butir",
    "bahan6":"Bawang merah - 10 butir"
  },
  {
    "regname":"jatim",
    "fdnm": "Pecel Madiun",
    "imgurl": "https://user-images.githubusercontent.com/106671990/208850031-17b8255e-34db-45ae-9ff6-3895d2b418e2.png",
    "imgurl2":"https://user-images.githubusercontent.com/106671990/208839179-e6b24ae1-bae4-4b41-9906-b7aa550f35f9.png",
    "desc":"Rawon merupakan salah satu makanan khas Jawa Timur yang mudah didapatkan di mana saja, mulai dari warung-warung kecil hingga restoran-restoran besar. Rawon terbuat dari daging dan kuah daging sapi yang ditambah bumbu-bumbu untuk mendapatkan citarasa khas rawon. Bumbu rawon terdiri dari berbagai macam rempah-rempah, seperti bawang merah, bawang putih, kemiri, cabe merah, dan kluwak.",
    "type":"berkuah",
    "Kalori":"60",
    "Protein":"5.4",
    "Lemak":"2.5",
    "Karbohidrat":"4",
    "langkah1":"Goreng cabai, bawang putih dan kencur hingga layu, angkat. Haluskan selagi panas bersama daun jeruk, terasi, gula merah, asam jawa dan garam. Campurkan bersama kacang halus, kemudian larutkan dengan air panas, aduk hingga larut.",
    "langkah2":"Panaskan minyak goreng dalam wajan, tumis bumbu halus. Masukkan daun salam dan serai, aduk hingga baunya harum, masukkan air asam, garam, air dan gula merah.",
    "langkah3":"Aduk dan masak di atas api kecil hingga gula larut dan mengental (berserabut), masukkan tempe goreng, bawang goreng dan cabai goreng, aduk cepat hingga tempe tercampur bumbu.",
    "langkah4":"Rebus kangkung, kol dan kacang panjang secara terpisah, angkat, tiriskan. Seduh taoge dengan air panas, tiriskan. Siangi kemangi, biarkan mentah.",
    "bahan1":"250 g kacang panjang, iris 3 cm",
    "bahan2":"150 g taoge, buang akarnya",
    "bahan3":"50 g daun kemangi",
    "bahan4":"200 g kangkung, siangi",
    "bahan5":"Sambal pecel",
    "bahan6":"Kering tempe"
  },
  {
    "regname":"jatim",
    "fdnm": "Bakso Malang",
    "imgurl": "https://user-images.githubusercontent.com/106671990/208893435-85e920d9-800c-4ba2-b207-3246dc841745.png",
    "imgurl2":"https://user-images.githubusercontent.com/106671990/208838790-79cb7665-2787-474c-a7c3-51ca8123aafa.png",
    "desc":"Bakso Malang adalah hidangan bakso yang banyak ditemui di seluruh belahan Kota Malang dan Kabupaten Malang, Jawa Timur. Mirip dengan hidangan bakso lainnya, hidangan tersebut terdiri dari daging yang dibentuk bundar dan mi. Bedanya ada pada penambahan kulit pangsit yang digoreng dan tahu yang digoreng.",
    "type":"berkuah",
    "Kalori":"57",
    "Protein":"3.74",
    "Lemak":"3.69",
    "Karbohidrat":"2.12",
    "langkah1":"campur daging giling, tepung sagu, bumbu yang dihaluskan, air es, dan telur. Aduk rata sambil dibanting-banting. Ambil 1/3 adonan untuk isian tahu. Sisa adonan dibentuk menjadi bola-bola bakso ukuran besar dan kecil. Didihkan air, lalu matikan apinya. Masukkan bakso ke dalam air mendidih. Masak kembali hingga bakso mengapung. Angkat dan tiriskan.",
    "langkah2":"didihkan air, bumbu yang dihaluskan, dan tulang. Masak hingga mendidih, angkat lalu saring. Taburi daun bawang, angkat.",
    "langkah3":"Ambil tahu, beri adonan bakso di bagian yang dikerat. Kukus sebentar.",
    "langkah4":"Beri kuah, taburi daun bawang, dan bawang goreng.",
    "bahan1":"350 gram daging sapi, giling halus",
    "bahan2":"50 gram tepung sagu",
    "bahan3":"10 tahu goreng, potong serong, toreh sedikit",
    "bahan4":"4 siung bawang putih",
    "bahan5":"600 gram tulang sapi",
    "bahan6":"150 gram mi kuning basah"
  },
  {
    "regname":"jatim",
    "fdnm": "Rawon",
    "imgurl": "https://user-images.githubusercontent.com/106671990/208893727-170c5d89-684a-4e96-b4d4-dc380d2b64b7.png",
    "imgurl2":"https://user-images.githubusercontent.com/106671990/208839380-6de41786-5118-4e79-b863-1a486da815c8.png",
    "desc":"Gethuk pisang merupakan makanan khas dari Kediri yang terbuat dari bahan dasar pisang dan disajikan dengan cara dibungkus daun pisang. Gethuk pisang terbuat dari pisang khusus yaitu jenis pisang raja nangka.",
    "type":"berkuah",
    "Kalori":"144",
    "Protein":"1.1",
    "Lemak":"0.4",
    "Karbohidrat":"34.1",
    "langkah1":"Rebus daging sapi yang sudah dicuci bersih lalu masukan daun jeruk, daun salam serta serai yang sudah dimemarkan. Rebus hingga empuk, setelah empuk potong daging sapi berbentuk dadu atau sesuai selera kamu. Air rebusan tidak perlu dibuang karena bisa digunakan kembali untuk memasak.",
    "langkah2":"Siapkan bumbu halus antara lain bawang merah, bawang putih, ketumbar, kunyit, cabai merah, kunyit dan garam. Haluskan bisa dengan ulekan maupun blender. Dan untuk jahe dan lengkuas digeprek saja atau dimemarkan.",
    "langkah3":"Siapkan wajan tuangkan minyak sedikit untuk menumis bumbu halus dan kluwek. Tunggu hingga aroma harum.",
    "langkah4":"Setelah itu masukan air sisa rebusan daging sapi dan daging sapi yang telah dipotong dadu. Tambahkan gula sedikit dan kaldu bubuk sapi setengah sachet saja. Koreksi rasa dan masak hingga matang.",
    "bahan1":"250 Gr Daging Sapi (Dicuci bersih)",
    "bahan2":"2 Buah Kluwek (Ambil bagian isi lalu rendam menggunakan air hangat sedikit saja)",
    "bahan3":"2 Lembar Daun salam",
    "bahan4":"2 Lembar Daun jeruk",
    "bahan5":"1 Batang Serai",
    "bahan6":"Bumbu Halus"
  },
  {
    "regname":"jatim",
    "fdnm": "Soto Lamongan",
    "imgurl": "https://user-images.githubusercontent.com/106671990/208894237-1675c57f-4413-4ace-bfdc-ffa234e51aad.png",
    "imgurl2":"https://user-images.githubusercontent.com/106671990/208839526-abe4ebf0-ec1c-475f-9681-162ce4d0866a.png",
    "desc":"Tahu campur adalah salah satu makanan khas Jawa Timur, tepatnya dari kota Lamongan. Tahu campur terdiri dari sop daging sapi kenyal, kikil sapi, tahu goreng, perkedel singkong, taoge segar, selada air segar, mi kuning, dan kerupuk udang. Semua ini kemudian dicampurkan ke bumbu petis, bawang goreng, dan sambal. Masakan ini banyak dijual di warung kaki lima dengan label Tahu Campur Lamongan.",
    "type":"berkuah",
    "Kalori":"80",
    "Protein":"10.9",
    "Lemak":"4.7",
    "Karbohidrat":"0.8",
    "langkah1":"Rebus ayam sampai mendidih, saring kaldunya kemudian didihkan kembali hingga tersisa 2 liter air, sisihkan.",
    "langkah2":"Siapkan minyak, goreng sebentar ayam yang tadi direbus, angkat, tiriskan. Dan bila sudah dingin ayam tersebut disuwir kecil-kecil.",
    "langkah3":"Panaskan minyak goreng untuk menumis bumbu halus, serai dan daun jeruk, hingga harum.",
    "langkah4":"Masukkan bumbu tumisan ke air kaldu, tambahkan garam dan gula, masak hingga matang",
    "bahan1":"1 ekor ayam ukuran sedang",
    "bahan2":"5 butir telur ayam rebus",
    "bahan3":"2 liter air kaldu ayam",
    "bahan4":"6 lembar daun jeruk",
    "bahan5":"1 batang serai (bagian putihnya), memarkan",
    "bahan6":"Gula dan Garam secukupnya"
  }
]