[
  {
    "fdnm": "Bandeng Kuah Kuning",
    "imgurl": "https://img-global.cpcdn.com/recipes/75c8c5cecf84f413/1200x630cq70/photo.jpg",
    "desc":"ikan kuah kuning dengan bahan bandeng ini menjadi salah satu kuliner yang biasa disajikan dengan papeda. Bahan baku ikan bandeng ini sama dengan kuliner Papua lain, yaitu ikan bungkus. Bedanya pengolahan ikan bungkus dimasak dengan cara dipepes.",
    "type":"berkuah",
    "Kalori":"619",
    "Protein":"20,53",
    "Lemak":"6,73",
    "Karbohidrat":"10"
  },
  {
    "fdnm": "Papeda",
    "imgurl": "https://blue.kumparan.com/image/upload/fl_progressive,fl_lossy,c_fill,q_auto:best,w_640/v1638945512/vpcpzm6didjyctkzmr1u.jpg",
    "desc":"Papeda adalah makanan berupa bubur sagu khas Maluku dan Papua yang biasanya disajikan dengan ikan tongkol atau bubara yang dibumbui dengan kunyit. Papeda berwarna putih dan bertekstur lengket seperti lem dengan rasa yang tawar.",
    "type":"berkuah",
    "Kalori":"209",
    "Protein":"0,3",
    "Lemak":"0,2",
    "Karbohidrat":"51,6"
  },
  {
    "fdnm": "Aunuve Habre",
    "imgurl": "https://t-2.tstatic.net/tribunnewswiki/foto/bank/images/Ilustrasi-Aunuve-Habre-khas-Papua2.jpg",
    "desc":"Aunuve Habre adalah makanan khas Papua yaitu ikan sakalang yang dipotong-potong dibungkus daun talas dan dimasak dengan air dan garam diatas wajan.",
    "type":"berkuah",
    "Kalori":"619",
    "Protein":"20,53",
    "Lemak":"6,73",
    "Karbohidrat":"8"
  },
  {
    "fdnm": "Kue Lontar",
    "imgurl": "https://asset.kompas.com/crops/Omq_RKy0VkXdqlDyvPl4noBESF0=/84x0:674x393/750x500/data/photo/2021/10/02/6157c779718b6.jpg",
    "desc":"Kue lontar punya tekstur lembut di bagian dalam dan renyah pada kulit luarnya. Unsur susu menjadi faktor utama dari lembutnya rasa kue dan menambah kelezatannya. Di Papua, kue lontar umumnya dibuat berukuran cukup besar dengan diameter bisa mencapai 20 sentimeter dan memerlukan sebuah cetakan kue khusus.",
    "type":"berkuah",
    "Kalori":"230",
    "Protein":"8,5",
    "Lemak":"9,1",
    "Karbohidrat":"50,85"
  },
  {
    "fdnm": "Tahu Campur",
    "imgurl": "https://asset.kompas.com/crops/Nv5RHVAQ4Qk2Q3BdCm-nk2QXtMI=/194x35:960x545/750x500/data/photo/2018/09/19/1428271598.jpg",
    "desc":"Abon Gulung merupakan makanan ringan khas Manokwari yang kerap ditemui di setiap bandara yang ada di Papua maupun Papua Barat. Abon gulung sebenarnya adalah roti gulung yang di tengahnya berisi abon. Namun entah mengapa kelembutan roti ini yang biasanya berasa manis berganti menjadi rasa gurih. Sehingga sangat cocok untuk dijadikan hidangan utama bukan hidangan pembuka. Roti ini hanya diproduksi oleh satu pabrik roti bernama Hawai Bakery yang terletak di Manokwari.",
    "type":"berkuah",
    "Kalori":"70",
    "Protein":"18",
    "Lemak":"10,6",
    "Karbohidrat":"59,3"
  }
]